// 10.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
using namespace std;

int main()
{
    setlocale(0, "");
    int S, l1, r1, l2, r2;
    cout << "Введите число, затем 2 диапазона целых чисел:\n";
    cin >> S >> l1 >> r1 >> l2 >> r2;
    if (-pow(10, 15) < S && -pow(10, 15) < l1 && -pow(10, 15) < r1 && -pow(10, 15) < l2 && -pow(10, 15) < r2 && pow(10, 15) > S && pow(10, 15) > l1 && pow(10, 15) > r1 && pow(10, 15) > l2 && pow(10, 15) > r2 && l1 <= r1 && l2 <= r2)
    {
        if (l1 + l2 == S) { cout << l1 << " " << l2; }
        else if (l1 + r2 == S) { cout << l1 << " " << r2; }
        else
        {
            if (r1 + l2 == S) { cout << r1 << " " << l2; }
            else if (r1 + r2 == S) { cout << r1 << " " << r2; }
            else { cout << -1 << ", таких чисел не существует"; }
        }
    }
    else if (l1 > r1 || l2 > r2) { cout << "данные не соответствуют условям : "<< l1<<" <= "<< r1<<"; "<< l2<< " <= "<< r2; }
    else { cout << "слишком большие или малые данные"; }
}

